src/InformationRegisters/ВремяРаботыСотрудниковПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВремяРаботыСотрудниковПлан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцОтбор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СвободныеИнтервалыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвободныеИнтервалыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньИнтервала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыРабочегоВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больничный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ОтображенияЭлементовВЖурналеЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОтображенияЭлементовВЖурналеЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтображениеВариантНеОтображать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеВариантОтображать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеВремениВариант1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеВремениВариант2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеВремениВариант3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеКлиентаВариант1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеКлиентаВариант2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеКлиентаВариант3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеКлиентаВариант4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеКлиентаВариант5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСортировкаВариант1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСортировкаВариант2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСортировкаВариант3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСотрудникаВариант1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСотрудникаВариант2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСотрудникаВариант3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСотрудникаВариант4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеСотрудникаВариант5</Name>
					<Comment>Представление в онлайн-записи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеТекущегоДняВариант1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеТекущегоДняВариант2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеФильтровВариант1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтображениеФильтровВариант2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПациентОжидает</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНачат</Name>
					<Comment>Пациент в кресле</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОкончен</Name>
					<Comment>Прием окончен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНеСостоялся</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтменен</Name>
					<Comment>Прием отменен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ВремяРаботыСотрудниковПлан/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура корректировки интервала рабочего времени сотрудника
Процедура УстановкаРабочегоВремениСотрудника(
		СтруктурнаяЕдиница, 
		Сотрудник, 
		РасширениеИнтервала, 
		НачалоПериода, 
		КонецПериода,
		ТипРабочегоВремени = Неопределено) Экспорт
		
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;	
	КонецЕсли;
		
	НаборЗаписей = РегистрыСведений.ВремяРаботыСотрудниковПлан.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение      = СтруктурнаяЕдиница;
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Использование = Истина;	
	НаборЗаписей.Отбор.Сотрудник.Значение               = Сотрудник;
	НаборЗаписей.Отбор.Сотрудник.Использование          = Истина;
    НаборЗаписей.Отбор.МесяцОтбор.Значение              = НачалоМесяца(НачалоПериода);
	НаборЗаписей.Отбор.МесяцОтбор.Использование         = Истина;

	НаборЗаписей.Прочитать();
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	
	// Добавляем период или удаляем его из всех периодов
	Если РасширениеИнтервала Тогда
		НоваяСтрока = ТаблицаДвижений.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница 	= НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение;
		НоваяСтрока.Сотрудник 			= НаборЗаписей.Отбор.Сотрудник.Значение;
		НоваяСтрока.МесяцОтбор 			= НаборЗаписей.Отбор.МесяцОтбор.Значение;
		НоваяСтрока.ДатаВремяНачала		= НачалоПериода;
		НоваяСтрока.ДатаВремяОкончания	= КонецПериода;
		НоваяСтрока.Минуты				= (КонецПериода - НачалоПериода) / 60;
		НоваяСтрока.ТипРабочегоВремени  = ТипРабочегоВремени;
	Иначе
		Счетчик = 0;
		Пока Счетчик <= ТаблицаДвижений.Количество() - 1 Цикл
			СтрокаТЗ = ТаблицаДвижений[Счетчик];
			Если СтрокаТЗ.ДатаВремяНачала >= НачалоПериода И СтрокаТЗ.ДатаВремяНачала <= КонецПериода Тогда
				СтрокаТЗ.ДатаВремяНачала = КонецПериода;
				СтрокаТЗ.Минуты = (СтрокаТЗ.ДатаВремяОкончания - СтрокаТЗ.ДатаВремяНачала) / 60;
			КонецЕсли;
			Если СтрокаТЗ.ДатаВремяОкончания >= НачалоПериода И СтрокаТЗ.ДатаВремяОкончания <= КонецПериода Тогда
				СтрокаТЗ.ДатаВремяОкончания = НачалоПериода;
				СтрокаТЗ.Минуты = (СтрокаТЗ.ДатаВремяОкончания - СтрокаТЗ.ДатаВремяНачала) / 60;
			КонецЕсли;
			Если СтрокаТЗ.ДатаВремяНачала < НачалоПериода И СтрокаТЗ.ДатаВремяОкончания > КонецПериода Тогда
				НоваяСтрока = ТаблицаДвижений.Вставить(Счетчик);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
				НоваяСтрока.ДатаВремяНачала = КонецПериода;
				НоваяСтрока.Минуты = (НоваяСтрока.ДатаВремяОкончания - НоваяСтрока.ДатаВремяНачала) / 60;
				СтрокаТЗ.ДатаВремяОкончания = НачалоПериода;
				СтрокаТЗ.Минуты = (СтрокаТЗ.ДатаВремяОкончания - СтрокаТЗ.ДатаВремяНачала) / 60;
			КонецЕсли;			
			Если СтрокаТЗ.ДатаВремяНачала >= СтрокаТЗ.ДатаВремяОкончания Тогда
				ТаблицаДвижений.Удалить(СтрокаТЗ);
				Счетчик = Счетчик - 1;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;
		
	// Сворачиваем периоды если необходимо
	ТаблицаДвижений.Сортировать("ДатаВремяНачала, ДатаВремяОкончания");
	Счетчик = 0;
	Пока Счетчик < ТаблицаДвижений.Количество() - 1 Цикл
		СтрокаТЗ = ТаблицаДвижений[Счетчик];	СтрокаТЗСлед = ТаблицаДвижений[Счетчик+1];
		Если СтрокаТЗ.ДатаВремяНачала >= СтрокаТЗСлед.ДатаВремяНачала И СтрокаТЗ.ДатаВремяНачала <= СтрокаТЗСлед.ДатаВремяОкончания Тогда
			СтрокаТЗ.ДатаВремяНачала = СтрокаТЗСлед.ДатаВремяНачала;
			СтрокаТЗСлед.ДатаВремяНачала = СтрокаТЗ.ДатаВремяОкончания;
		ИначеЕсли СтрокаТЗСлед.ДатаВремяНачала >= СтрокаТЗ.ДатаВремяНачала И СтрокаТЗСлед.ДатаВремяНачала <= СтрокаТЗ.ДатаВремяОкончания Тогда
			СтрокаТЗСлед.ДатаВремяНачала = СтрокаТЗ.ДатаВремяОкончания;			
		КонецЕсли;
		Если СтрокаТЗ.ДатаВремяОкончания >= СтрокаТЗСлед.ДатаВремяНачала И СтрокаТЗ.ДатаВремяОкончания <= СтрокаТЗСлед.ДатаВремяОкончания Тогда
			СтрокаТЗ.ДатаВремяОкончания = СтрокаТЗСлед.ДатаВремяОкончания;
			СтрокаТЗСлед.ДатаВремяОкончания = СтрокаТЗ.ДатаВремяНачала;
		ИначеЕсли СтрокаТЗСлед.ДатаВремяОкончания >= СтрокаТЗ.ДатаВремяНачала И СтрокаТЗСлед.ДатаВремяОкончания <= СтрокаТЗ.ДатаВремяОкончания Тогда
			СтрокаТЗСлед.ДатаВремяОкончания = СтрокаТЗ.ДатаВремяНачала;			
		КонецЕсли;
		СтрокаТЗ.Минуты = (СтрокаТЗ.ДатаВремяОкончания - СтрокаТЗ.ДатаВремяНачала) / 60;
		Если СтрокаТЗСлед.ДатаВремяНачала >= СтрокаТЗСлед.ДатаВремяОкончания Тогда
			ТаблицаДвижений.Удалить(СтрокаТЗСлед);
			Счетчик = Счетчик - 1;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
		
	// Записываем набор данных
	НаборЗаписей.Загрузить(ТаблицаДвижений);
	НаборЗаписей.Записать(Истина);
	
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(Сотрудник);
	РегистрыСведений.СвободныеИнтервалыСотрудников.СформироватьИнтервалыПоСотрудникам(
		СтруктурнаяЕдиница, 
		МассивСотрудников, 
		НачалоДня(НачалоПериода), 
		КонецДня(КонецПериода));
	
КонецПроцедуры

// Функция проверяет работает ли сотрудник в переданный период времени
//
Функция ПроверитьВозможностьЗаписиРабочегоВремени (НачалоПериода, КонецПериода, Сотрудник, СтруктурнаяЕдиница, ОписаниеОграничения = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если НачалоПериода <> КонецПериода Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГрафикРаботы.ДатаВремяНачала КАК ДатаНачала,
		|	ГрафикРаботы.ДатаВремяОкончания КАК ДатаОкончания,
		|	ГрафикРаботы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ГрафикРаботы.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ГрафикРаботы
		|ГДЕ
		|	ГрафикРаботы.Сотрудник = &Сотрудник
		|	И ГрафикРаботы.СтруктурнаяЕдиница <> &СтруктурнаяЕдиница
		|	И ГрафикРаботы.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск)
		|	И ГрафикРаботы.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный)
		|	И (&НачалоПериода МЕЖДУ ГрафикРаботы.ДатаВремяНачала И ГрафикРаботы.ДатаВремяОкончания
		|			ИЛИ &КонецПериода МЕЖДУ ГрафикРаботы.ДатаВремяНачала И ГрафикРаботы.ДатаВремяОкончания
		|			ИЛИ ГрафикРаботы.ДатаВремяНачала МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ ГрафикРаботы.ДатаВремяОкончания МЕЖДУ &НачалоПериода И &КонецПериода)");
		
		
		Запрос.УстановитьПараметр("Сотрудник"         , Сотрудник);
		Запрос.УстановитьПараметр("НачалоПериода"     , НачалоПериода+1);
		Запрос.УстановитьПараметр("КонецПериода"      , КонецПериода-1);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница); 	
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий() Тогда
			ОписаниеОграничения = "Сотрудник " + Выборка.Сотрудник + " уже работает в указанное время в клинике: " + Выборка.СтруктурнаяЕдиница;
			Возврат Ложь;
		Иначе
			Возврат Истина; 
		КонецЕсли;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;	
	
КонецФункции

// Функция проверяет возможность удаления планового рабочего времени сотрудника в данной СЕ
Функция ПроверитьВозможностьУдаленияРабочегоВремени(НачалоПериода, КонецПериода, Сотрудник, СтруктурнаяЕдиница, ВозвратСообщения = "", ПризнакДежурства = Ложь) Экспорт
	
	ЕстьЗаписи = Ложь;
	
	МассивПериодов = Новый Массив;
    Структура      = Новый Структура();
	Структура.Вставить("НачалоСмены"   ,НачалоПериода);
	Структура.Вставить("ОкончаниеСмены",КонецПериода);
	МассивПериодов.Добавить(Структура);

	Если Не ПризнакДежурства Тогда
		ЕстьЗаписи = ОбщегоНазначенияСтоматология.ПроверитьНаличиеПредварительнойЗаписи(Сотрудник, НачалоПериода, МассивПериодов, СтруктурнаяЕдиница);
		Если ЕстьЗаписи Тогда
			ВозвратСообщения = "Для сотудника ["+Сотрудник+"] в удаляемом периоде существуют предварительные записи.";
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ ЕстьЗаписи;
	
КонецФункции

// Функция проверяет работает ли сотрудник в переданный период времени
// 
// Параметры:
// ВернутьГрафикРаботы - Если истина, возвращает график работы сотрудника, либо список приемов (на дату)
//
Функция ПроверитьРаботаетЛиСотрудникВпериодВремя(Период, ВремяНачала, ВремяОкончания, Сотрудник, СтруктурнаяЕдиница, ПризнакДежурства = Ложь, ВернутьГрафикРаботы = Ложь) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ГрафикРаботы.ДатаВремяНачала КАК ДатаНачала,
	                      |	ГрафикРаботы.ДатаВремяОкончания КАК ДатаОкончания
	                      |ИЗ
	                      |	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ГрафикРаботы
	                      |ГДЕ
	                      |	ГрафикРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                      |	И ГрафикРаботы.Сотрудник = &Сотрудник
	                      |	И НАЧАЛОПЕРИОДА(ГрафикРаботы.ДатаВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&НачалоСобытия, ДЕНЬ)");
						  
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник"         , Сотрудник);
	Запрос.УстановитьПараметр("НачалоСобытия"     , Период);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ВернутьГрафикРаботы Тогда
	
		Для Каждого СтрокаСотр из Выборка Цикл
			
			Работает = Ложь;
			Если ВремяНачала >= СтрокаСотр.ДатаНачала И ВремяОкончания <= СтрокаСотр.ДатаОкончания Тогда
				Возврат Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Возврат Ложь;
		
	Иначе
		Возврат Выборка; 
	КонецЕсли;
	
КонецФункции

// Функция - вернет сотрудников работающих в указанный интервал времени
// 
// Параметры:
//  ДатаВремяНачала		 - 	 - 
//  ДатаВермяокончания	 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Помещение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СотрудникиРаботающиевУказанныйПериод_Old(
	ОтборДатаВремяНачала 	= Неопределено,
	ОтборДатаВремяОкончания = Неопределено, 
	ОтборСтруктурнаяЕдиница = Неопределено, 
	ОтборДолжность 			= Неопределено,
	ОтборРольПользователя   = Неопределено,
	ОтборСортировка 		= Неопределено,
	ОтображатьВРасписании	= Неопределено,
	ОтборСпециализации		= Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос       = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
	|	И &УсловиеРольПользователя
	|	И &УсловиеДолжность
	|	И &УсловиеОтображатьВРасписании
	|	И &УсловиеСпециализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиПользователей.Пользователь КАК Пользователь,
	|	НастройкиПользователей.Значение КАК Значение
	|ПОМЕСТИТЬ ВТСотрудникиУволнение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь В
	|			(ВЫБРАТЬ
	|				ВТСотрудники.Ссылка
	|			ИЗ
	|				ВТСотрудники)
	|	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаУвольнения)
	|	И НастройкиПользователей.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСотрудники.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудникиНЕУволенные
	|ИЗ
	|	ВТСотрудники КАК ВТСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиУволнение КАК ВТСотрудникиУволнение
	|		ПО ВТСотрудники.Ссылка = ВТСотрудникиУволнение.Пользователь
	|ГДЕ
	|	(ВТСотрудникиУволнение.Значение >= &ОтборДатаВремяНачалаРаботы
	|			ИЛИ ЕСТЬNULL(ВТСотрудникиУволнение.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.Сотрудник.Наименование КАК СотрудникНаименование,
	|	СотрудникиСпецилазацииСотрудника.Специализация.Наименование КАК СпециализацияНаименование,
	|	ВремяРаботыСотрудниковПлан.Сотрудник.Должность.Наименование КАК СотрудникДолжностьНаименование
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|		ПО ВремяРаботыСотрудниковПлан.Сотрудник = СотрудникиСпецилазацииСотрудника.Ссылка
	|			И (СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА)
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТСотрудникиНЕУволенные.Сотрудник
	|			ИЗ
	|				ВТСотрудникиНЕУволенные)
	|	И (ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &ОтборДатаВремяНачалаРаботы
	|				И ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &ОтборДатаВремяОкончанияРаботы
	|			ИЛИ ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ОтборДатаВремяНачалаРаботы
	|				И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания <= &ОтборДатаВремяОкончанияРаботы
	|			ИЛИ ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &ОтборДатаВремяНачалаРаботы
	|				И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ОтборДатаВремяОкончанияРаботы)
	|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|	И НЕ ВремяРаботыСотрудниковПлан.ТипРабочегоВремени В (ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск), ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный))";
	
	УсловиеРольПользователя = ?(ОтборРольПользователя = Неопределено Или ОтборРольПользователя.Количество() = 0, "", "И Сотрудники.РольПользователя В(&ОтборРольПользователя)");
	УсловиеДолжность        = ?(ОтборДолжность = Неопределено Или ОтборДолжность.Количество() = 0, "", "И Сотрудники.Должность В(&ОтборДолжность)");
    ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеРольПользователя", УсловиеРольПользователя);	
    ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеДолжность", УсловиеДолжность);	
	
	УсловиеОтображатьВРасписании = ?(ОтображатьВРасписании = Неопределено, "", "И Сотрудники.Должность.ОтображатьВЖурналеПредварительнойЗаписи = &ОтображатьВРасписании");
    ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтображатьВРасписании", УсловиеОтображатьВРасписании);		
	
	УсловиеСпециализация    = ?(ОтборСпециализации = Неопределено Или ОтборСпециализации.Количество() = 0, "", "И Сотрудники.СпецилазацииСотрудника.Специализация В(&ОтборСпециализации)");
	ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеСпециализация", УсловиеСпециализация);	
	
	СортировкаТекст = ПолучитьТекстСортировкиЗапроса(ОтборСортировка);
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + СортировкаТекст;

	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ОтборДатаВремяНачалаРаботы"   , ?(ЗначениеЗаполнено(ОтборДатаВремяНачала)        , ОтборДатаВремяНачала           , Неопределено));
	Запрос.УстановитьПараметр("ОтборДатаВремяОкончанияРаботы", ?(ЗначениеЗаполнено(ОтборДатаВремяОкончания)     , ОтборДатаВремяОкончания        , Неопределено));
    Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница"      , ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница)     , ОтборСтруктурнаяЕдиница        , Неопределено));
	Запрос.УстановитьПараметр("ОтборДолжность"               , ?(ЗначениеЗаполнено(ОтборДолжность)              , ОтборДолжность                 , Неопределено));	
	Запрос.УстановитьПараметр("ОтборРольПользователя"        , ?(ЗначениеЗаполнено(ОтборРольПользователя)       , ОтборРольПользователя          , Неопределено));	
	Запрос.УстановитьПараметр("ОтображатьВРасписании"        , ?(ЗначениеЗаполнено(ОтображатьВРасписании)       , ОтображатьВРасписании          , Неопределено));	
	Запрос.УстановитьПараметр("ОтборСпециализации"        	 , ?(ЗначениеЗаполнено(ОтборСпециализации)       	, ОтборСпециализации          	 , Неопределено));	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

// Функция - вернет сотрудников работающих в указанный интервал времени
// 
// Параметры:
//  ДатаВремяНачала		 - 	 - 
//  ДатаВермяокончания	 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Помещение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СотрудникиРаботающиеВУказанныйПериод(
	ОтборДатаВремяНачала 	= Неопределено,
	ОтборДатаВремяОкончания = Неопределено, 
	ОтборСтруктурнаяЕдиница = Неопределено, 
	ОтборДолжность 			= Неопределено,
	ОтборРольПользователя   = Неопределено,
	ОтборСортировка 		= Неопределено,
	ОтображатьВРасписании	= Неопределено,
	ОтборСпециализации		= Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос       = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудникиПоГрафику
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &ОтборДатаВремяНачалаРаботы
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &ОтборДатаВремяОкончанияРаботы
	|	И НЕ ВремяРаботыСотрудниковПлан.ТипРабочегоВремени В (ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск), ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремяРаботыСотрудниковПлан.Сотрудник
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ОтборДатаВремяНачалаРаботы
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания <= &ОтборДатаВремяОкончанияРаботы
	|	И НЕ ВремяРаботыСотрудниковПлан.ТипРабочегоВремени В (ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск), ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремяРаботыСотрудниковПлан.Сотрудник
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &ОтборДатаВремяНачалаРаботы
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ОтборДатаВремяОкончанияРаботы
	|	И НЕ ВремяРаботыСотрудниковПлан.ТипРабочегоВремени В (ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск), ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСотрудникиПоГрафику.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	ВТСотрудникиПоГрафику КАК ВТСотрудникиПоГрафику
	|ГДЕ
	|	ВТСотрудникиПоГрафику.Сотрудник.ЭтоГруппа = ЛОЖЬ
	|	И ВТСотрудникиПоГрафику.Сотрудник.ПометкаУдаления = ЛОЖЬ
	|	И &УсловиеРольПользователя
	|	И &УсловиеДолжность
	|	И &УсловиеОтображатьВРасписании
	|	И &УсловиеСпециализация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТСотрудникиУволенные
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТСотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТСотрудники КАК ВТСотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСпецилазацииСотрудника.Ссылка КАК Сотрудник,
	|	МАКСИМУМ(СотрудникиСпецилазацииСотрудника.Специализация) КАК Специализация
	|ПОМЕСТИТЬ ТаблицаСпециализаций
	|ИЗ
	|	Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|ГДЕ
	|	СотрудникиСпецилазацииСотрудника.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТСотрудники КАК ВТСотрудники)
	|	И СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиСпецилазацииСотрудника.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСотрудники.Сотрудник КАК Сотрудник,
	|	ВТСотрудники.Сотрудник.Должность.Наименование КАК СотрудникДолжностьНаименование,
	|	ВТСотрудники.Сотрудник.Наименование КАК СотрудникНаименование,
	|	ЕСТЬNULL(ТаблицаСпециализаций.Специализация.Наименование, """") КАК НаименованиеСпециализации
	|ИЗ
	|	ВТСотрудники КАК ВТСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСпециализаций КАК ТаблицаСпециализаций
	|		ПО ВТСотрудники.Сотрудник = ТаблицаСпециализаций.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиУволенные КАК ВТСотрудникиУволенные
	|		ПО ВТСотрудники.Сотрудник = ВТСотрудникиУволенные.Сотрудник
	|ГДЕ
	|	(ВТСотрудникиУволенные.ДатаУвольнения > &ОтборДатаВремяНачалаРаботы
	|			ИЛИ ЕСТЬNULL(ВТСотрудникиУволенные.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТаблицаСпециализаций.Специализация.Наименование, """"),
	|	ВТСотрудники.Сотрудник,
	|	ВТСотрудники.Сотрудник.Должность.Наименование,
	|	ВТСотрудники.Сотрудник.Наименование";
	
	УсловиеРольПользователя = ?(ОтборРольПользователя = Неопределено Или ОтборРольПользователя.Количество() = 0, "", "И ВТСотрудникиПоГрафику.Сотрудник.РольПользователя В(&ОтборРольПользователя)");
	УсловиеДолжность        = ?(ОтборДолжность = Неопределено Или ОтборДолжность.Количество() = 0, "", "И ВТСотрудникиПоГрафику.Сотрудник.Должность В(&ОтборДолжность)");
    ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеРольПользователя", УсловиеРольПользователя);	
    ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеДолжность", УсловиеДолжность);	
	
	УсловиеОтображатьВРасписании = ?(ОтображатьВРасписании = Неопределено, "", "И ВТСотрудникиПоГрафику.Сотрудник.Должность.ОтображатьВЖурналеПредварительнойЗаписи = &ОтображатьВРасписании");
    ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтображатьВРасписании", УсловиеОтображатьВРасписании);		
	
	УсловиеСпециализация    = ?(ОтборСпециализации = Неопределено Или ОтборСпециализации.Количество() = 0, "", "И ВТСотрудникиПоГрафику.Сотрудник.СпецилазацииСотрудника.Специализация В(&ОтборСпециализации)");
	ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "И &УсловиеСпециализация", УсловиеСпециализация);	
	
	СортировкаТекст = ПолучитьТекстСортировкиЗапроса(ОтборСортировка);
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + СортировкаТекст;

	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ОтборДатаВремяНачалаРаботы"   , ?(ЗначениеЗаполнено(ОтборДатаВремяНачала)        , ОтборДатаВремяНачала           , Неопределено));
	Запрос.УстановитьПараметр("ОтборДатаВремяОкончанияРаботы", ?(ЗначениеЗаполнено(ОтборДатаВремяОкончания)     , ОтборДатаВремяОкончания        , Неопределено));
    Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница"      , ?(ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница)     , ОтборСтруктурнаяЕдиница        , Неопределено));
	Запрос.УстановитьПараметр("ОтборДолжность"               , ?(ЗначениеЗаполнено(ОтборДолжность)              , ОтборДолжность                 , Неопределено));	
	Запрос.УстановитьПараметр("ОтборРольПользователя"        , ?(ЗначениеЗаполнено(ОтборРольПользователя)       , ОтборРольПользователя          , Неопределено));	
	Запрос.УстановитьПараметр("ОтображатьВРасписании"        , ?(ЗначениеЗаполнено(ОтображатьВРасписании)       , ОтображатьВРасписании          , Неопределено));	
	Запрос.УстановитьПараметр("ОтборСпециализации"        	 , ?(ЗначениеЗаполнено(ОтборСпециализации)       	, ОтборСпециализации          	 , Неопределено));	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

// Функция - Получить текст сортировки запроса.
//
// Параметры:
//  ОтборСортировка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекстСортировкиЗапроса(Знач ОтборСортировка)
		
	Если ОтборСортировка = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСортировкаВариант1 Тогда  
		// ФИО.
		
		СортировкаТекст = "УПОРЯДОЧИТЬ ПО
		|	ВТСотрудники.Сотрудник.Наименование";
		
		
	ИначеЕсли ОтборСортировка = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСортировкаВариант2
		ИЛИ ОтборСортировка = Неопределено Тогда 
		// Должность.
		
		СортировкаТекст = "УПОРЯДОЧИТЬ ПО
		|	ВТСотрудники.Сотрудник.Должность.Наименование,
		|	ВТСотрудники.Сотрудник.Наименование";
		
	Иначе
		
		СортировкаТекст = "УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ТаблицаСпециализаций.Специализация.Наименование, """"),
	|	ВТСотрудники.Сотрудник.Должность.Наименование,
	|	ВТСотрудники.Сотрудник.Наименование";
		
	КонецЕсли; 
	
	Возврат СортировкаТекст;

КонецФункции

// Функция, возвращает плановое время работы сотрудника.
// 
Функция ПолучитьПлановоеВремяРаботыСотрудника(НачалоПериода, КонецПериода, МассивСотрудников, СтруктурнаяЕдиница, МассивПомещений = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТСотрудникиУволенные
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НастройкиСотрудников.Сотрудник В(&МассивСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &ДатаНачала
	|			ТОГДА &ДатаНачала
	|		ИНАЧЕ ВремяРаботыСотрудниковПлан.ДатаВремяНачала
	|	КОНЕЦ КАК ДатаВремяНачала,
	|	ВЫБОР
	|		КОГДА ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ДатаОкончания
	|			ТОГДА &ДатаОкончания
	|		ИНАЧЕ ВремяРаботыСотрудниковПлан.ДатаВремяОкончания
	|	КОНЕЦ КАК ДатаВремяОкончания
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиУволенные КАК ВТСотрудникиУволнение
	|		ПО ВремяРаботыСотрудниковПлан.Сотрудник = ВТСотрудникиУволнение.Сотрудник
	|ГДЕ
	|	(ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &ДатаНачала
	|				И ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &ДатаОкончания
	|			ИЛИ ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ДатаНачала
	|				И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания <= &ДатаОкончания
	|			ИЛИ ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &ДатаНачала
	|				И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &ДатаОкончания)
	|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.Сотрудник В(&МассивСотрудников)
	|	И ВремяРаботыСотрудниковПлан.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск)
	|	И ВремяРаботыСотрудниковПлан.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный)
	|	И (ВТСотрудникиУволнение.ДатаУвольнения > ВремяРаботыСотрудниковПлан.ДатаВремяОкончания
	|			ИЛИ ЕСТЬNULL(ВТСотрудникиУволнение.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремяНачала");
		
	Запрос.УстановитьПараметр("ДатаНачала"        , НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания"     , КонецПериода);	
	Запрос.УстановитьПараметр("МассивСотрудников" , МассивСотрудников);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция проверяет работает ли сотрудник в переданный период времени
// 
Функция ПроверитьВхождениеИнтервалаВРабочееВремя(Сотрудник, ДатаВремяНачала, ДатаВремяОкончания, СтруктурнаяЕдиница, Помещение = Неопределено) Экспорт
	
	Если ДатаВремяНачала <> ДатаВремяОкончания Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикРаботы.ДатаВремяНачала КАК ДатаНачала,
		|	ГрафикРаботы.ДатаВремяОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ГрафикРаботы
		|ГДЕ
		|	ГрафикРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ГрафикРаботы.Сотрудник = &Сотрудник
		|	И ГрафикРаботы.ДатаВремяНачала <= &ДатаВремяНачала
		|	И ГрафикРаботы.ДатаВремяОкончания >= &ДатаВремяОкончания
		|	И ГрафикРаботы.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Отпуск)
		|	И ГрафикРаботы.ТипРабочегоВремени <> ЗНАЧЕНИЕ(Перечисление.ТипыРабочегоВремени.Больничный)");
		
		Запрос.УстановитьПараметр("Сотрудник"            , Сотрудник);
		Запрос.УстановитьПараметр("ДатаВремяНачала"      , ДатаВремяНачала);
		Запрос.УстановитьПараметр("ДатаВремяОкончания"   , ДатаВремяОкончания);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"   , СтруктурнаяЕдиница);
		
		Возврат НЕ Запрос.Выполнить().Пустой();
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

// Процедура, изменяет график работы сотрудников.
// 
Процедура ЗафиксироватьИзмененияВГрафикеСотрудников(СтруктурнаяЕдиница, БуферФормирования) Экспорт
	
	БуферФормирования.Сортировать("Сотрудник, Дата, Операция Убыв");
	МассивЗаполнения  = Новый Массив;
	НСтроки 	  	  = 0;
	МассивСотрудников = Новый Массив;
	НачалоПериода 	  = НачалоДня(ТекущаяДатаСеанса());
	КонецПериода  	  = Неопределено;
	
	Пока НСтроки < БуферФормирования.Количество() Цикл
		
		// Подготовка буфера фиксации данных в пределах текущего месяца и текущего сотрудника
		СтрокаБуфера     = БуферФормирования[НСтроки];
		СтрокаБуфераСлед = Неопределено;
		Если НСтроки < БуферФормирования.Количество() - 1 Тогда
			СтрокаБуфераСлед = БуферФормирования[НСтроки + 1];
		КонецЕсли;
		МесяцОтбора  = Дата(Год(СтрокаБуфера.Дата), Месяц(СтрокаБуфера.Дата), 01);
		
		МесяцОтбораСлед = Неопределено;
		Если НСтроки < БуферФормирования.Количество() - 1 Тогда
			МесяцОтбораСлед  = Дата(Год(СтрокаБуфераСлед.Дата), Месяц(СтрокаБуфераСлед.Дата), 01);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаБуфера.Операция) Тогда
			
			МассивЗаполнения.Добавить(СтрокаБуфера);
			
			Если МассивСотрудников.Найти(СтрокаБуфера.Сотрудник) = Неопределено Тогда
				МассивСотрудников.Добавить(СтрокаБуфера.Сотрудник);
			КонецЕсли;
			
			НачалоПериода = ?(НачалоПериода > СтрокаБуфера.Дата, СтрокаБуфера.Дата, НачалоПериода);
			КонецПериода  = ?(Не ЗначениеЗаполнено(КонецПериода) ИЛИ КонецПериода < СтрокаБуфера.Дата, СтрокаБуфера.Дата, КонецПериода);
			
		КонецЕсли;
		
		// Как только текущий сотрудник не совпадает с предыдущим или достигнут предел буфера
		// переходим к операции фиксации набора изменений по пред. сотруднику
		Если (СтрокаБуфераСлед = Неопределено
			ИЛИ СтрокаБуфераСлед.Сотрудник <> СтрокаБуфера.Сотрудник
			ИЛИ МесяцОтбораСлед <> МесяцОтбора)
			И МассивЗаполнения.Количество() > 0 Тогда
			
			// Создаем набор записей для конкретного сотрудника + разрез доп. параметров
			НаборЗаписей = РегистрыСведений.ВремяРаботыСотрудниковПлан.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
			НаборЗаписей.Отбор.МесяцОтбор.Установить(МесяцОтбора);
			НаборЗаписей.Отбор.Сотрудник.Установить(МассивЗаполнения[0].Сотрудник);
			
			НаборЗаписей.Прочитать();
			ВременнаяТаблица = НаборЗаписей.Выгрузить();
			
			Для Каждого ЭлементМ ИЗ МассивЗаполнения Цикл
				
				// Если на строке пометка удаления 
				// находим эти данные во временной таблице и удаляем
				Если ЭлементМ.Операция = "Удалить" Тогда
					// Необходимо пройти по всем интервалам рабочего времени в этот день
					
					Если ЭлементМ.Свойство("ТипРабочегоВремени")
						И (ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный 
						Или ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск) Тогда
						
						НайденныеСтроки = ВременнаяТаблица.НайтиСтроки(Новый Структура("ДатаВремяНачала", ЭлементМ.Дата));
						Для Каждого СтрокаН ИЗ НайденныеСтроки Цикл
							ВременнаяТаблица.Удалить(СтрокаН);
						КонецЦикла;

					Иначе
						
						Для Каждого ИнтервалВ ИЗ ЭлементМ.ИнтервалыРаботы Цикл
							ДатаВремяНачала = ЗаменитьВремяВДате(ЭлементМ.Дата,ИнтервалВ.Значение.НачалоРаботы);
							НайденныеСтроки = ВременнаяТаблица.НайтиСтроки(Новый Структура("ДатаВремяНачала", ДатаВремяНачала));
							Для Каждого СтрокаН ИЗ НайденныеСтроки Цикл
								ВременнаяТаблица.Удалить(СтрокаН);
							КонецЦикла;
						КонецЦикла;
						
					КонецЕсли;

					// Добавляем новые записи	
				ИначеЕсли ЭлементМ.Операция = "Создать" Тогда
					
					Если ЭлементМ.Свойство("ТипРабочегоВремени") 
						И (ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Больничный
						Или ЭлементМ.ТипРабочегоВремени = Перечисления.ТипыРабочегоВремени.Отпуск) Тогда
						
						НоваяСтрока                     = ВременнаяТаблица.Добавить();
						НоваяСтрока.СтруктурнаяЕдиница  = СтруктурнаяЕдиница;
						НоваяСтрока.МесяцОтбор          = МесяцОтбора;
						НоваяСтрока.Сотрудник           = ЭлементМ.Сотрудник;
						НоваяСтрока.ДатаВремяНачала     = ЭлементМ.Дата;
						НоваяСтрока.ДатаВремяОкончания  = ЭлементМ.Дата;
						НоваяСтрока.Минуты              = 0;
						НоваяСтрока.ТипРабочегоВремени  = ЭлементМ.ТипРабочегоВремени;
						
					Иначе
						
						Для Каждого ИнтервалВ ИЗ ЭлементМ.ИнтервалыРаботы Цикл
							НоваяСтрока                     = ВременнаяТаблица.Добавить();
							НоваяСтрока.СтруктурнаяЕдиница  = СтруктурнаяЕдиница;
							НоваяСтрока.МесяцОтбор          = МесяцОтбора;
							НоваяСтрока.Сотрудник           = ЭлементМ.Сотрудник;
							ИнтервалВ.Значение.НачалоРаботы 	= Дата(Год("00010101"), Месяц("00010101"), День("00010101"), Час(ИнтервалВ.Значение.НачалоРаботы), Минута(ИнтервалВ.Значение.НачалоРаботы), Секунда(ИнтервалВ.Значение.НачалоРаботы));
							ИнтервалВ.Значение.ОкончаниеРаботы  = Дата(Год("00010101"), Месяц("00010101"), День("00010101"), Час(ИнтервалВ.Значение.ОкончаниеРаботы), Минута(ИнтервалВ.Значение.ОкончаниеРаботы), Секунда(ИнтервалВ.Значение.ОкончаниеРаботы));
							НоваяСтрока.ДатаВремяНачала     = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ЭлементМ.Дата, ИнтервалВ.Значение.НачалоРаботы); //ЗаменитьВремяВДате(ЭлементМ.Дата, ИнтервалВ.Значение.НачалоРаботы);
							НоваяСтрока.ДатаВремяОкончания  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ЭлементМ.Дата, ИнтервалВ.Значение.ОкончаниеРаботы); //ЗаменитьВремяВДате(ЭлементМ.Дата, ИнтервалВ.Значение.ОкончаниеРаботы);
							НоваяСтрока.Минуты              = (НоваяСтрока.ДатаВремяОкончания - НоваяСтрока.ДатаВремяНачала) / 60;
							НоваяСтрока.ТипРабочегоВремени  = Перечисления.ТипыРабочегоВремени.Рабочее;
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Загрузить(ВременнаяТаблица);
			НаборЗаписей.Записать(Истина);
			
			МассивЗаполнения.Очистить();
			
		КонецЕсли;
		
		НСтроки = НСтроки + 1;
	КонецЦикла;
	
	// Если операция фиксации изменений прошла успешно, то очищаем пометки операций
	НСтроки = 0;
	Пока НСтроки < БуферФормирования.Количество() Цикл
		Если БуферФормирования[НСтроки].Операция = "Удалить" Тогда
			БуферФормирования.Удалить(БуферФормирования[НСтроки]);
			Продолжить;
		КонецЕсли;
		БуферФормирования[НСтроки].Операция             = Неопределено;
		БуферФормирования[НСтроки].НомерОчередиОперации = Неопределено;
		
		НСтроки = НСтроки + 1;
	КонецЦикла;
	
	РегистрыСведений.СвободныеИнтервалыСотрудников.СформироватьИнтервалыПоСотрудникам(СтруктурнаяЕдиница, МассивСотрудников, НачалоПериода, КонецДня(КонецПериода));
	
КонецПроцедуры   

// Функция, изменяет время в дате.
// 
Функция ЗаменитьВремяВДате(Дата, ВрямяНов)
	
	Возврат НачалоДня(Дата) + ?(ВрямяНов <> Дата(0001,01,02,00,00,00), ВрямяНов - НачалоДня(ВрямяНов), 86400); 	
	
КонецФункции

// Процедура - Актуализировать загруженность всех врачей.
//
// Параметры:
//  ОповещатьОХодеВыполнения - 	 - 
//
Функция ПолучитьЗагруженностьСотрудников(Параметры) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 															
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	НачалоПериода 		= Параметры.ДатаНачала;
	КонецПериода 		= Параметры.ДатаОкончания;
	МассивСотрудников 	= Параметры.МассивСотрудников; 
    СтруктурнаяЕдиница 	= Параметры.СтруктурнаяЕдиница;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Врач,
	|	ВремяРаботыСотрудниковПлан.Минуты / 60 КАК ПоПлану,
	|	0 КАК ПоФакту
	|ПОМЕСТИТЬ ВТ_Итогов
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачПериода
	|	И ВремяРаботыСотрудниковПлан.ДатаВремяНачала <= &КонПериода
	|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.Сотрудник В(&МассивСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СобытиеУслуги.Ссылка.СтруктурнаяЕдиница,
	|	СобытиеУслуги.Сотрудник,
	|	0,
	|	РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА) / 60
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка.Проведен
	|	И НЕ СобытиеУслуги.Ссылка.ПометкаУдаления
	|	И НЕ СобытиеУслуги.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|	И СобытиеУслуги.ДатаНачала >= &НачПериода
	|	И СобытиеУслуги.ДатаНачала <= &КонПериода
	|	И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СобытиеУслуги.Сотрудник В(&МассивСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итогов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_Итогов.Врач КАК Сотрудник,
	|	ВЫРАЗИТЬ(СУММА(ВТ_Итогов.ПоПлану) КАК ЧИСЛО(15, 2)) КАК ВремяРаботы,
	|	ВЫРАЗИТЬ(СУММА(ВТ_Итогов.ПоФакту) КАК ЧИСЛО(15, 2)) КАК ВремяПриемов,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Итогов.ПоПлану) = 0
	|			ТОГДА СУММА(ВТ_Итогов.ПоПлану)
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТ_Итогов.ПоФакту) * 100 / СУММА(ВТ_Итогов.ПоПлану) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПроцентЗагрузки
	|ИЗ
	|	ВТ_Итогов КАК ВТ_Итогов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итогов.СтруктурнаяЕдиница,
	|	ВТ_Итогов.Врач";
	
	Запрос.УстановитьПараметр("НачПериода"			, НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода"			, КонецПериода);
	Запрос.УстановитьПараметр("МассивСотрудников"	, МассивСотрудников);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить(); 
	
КонецФункции

#КонецОбласти
